# StructuralSectionLangleBoltDiameterShorterFlange Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionLangleBoltDiameterShorterFlange Property
ParameterTypeId Class See Also
---
"Bolt Diameter Shorter Flange"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionLangleBoltDiameterShorterFlange { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionLangleBoltDiameterShorterFlange As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionLangleBoltDiameterShorterFlange {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace